thofbaur/network-beacon/Network_Base_nrf51422/main.c
    ret = bsp_indication_set(BSP_INDICATE_SCANNING);
    APP_ERROR_CHECK(ret);
}



/**@brief Function for handling database discovery events.
 *
 * @details This function is callback function to handle events from the database discovery module.
 *          Depending on the UUIDs that are discovered, this function should forward the events
 *          to their respective services.
 *
 * @param[in] p_event  Pointer to the database discovery event.
 */
static void db_disc_handler(ble_db_discovery_evt_t * p_evt)
{
//	printf("\r\nDb Discovery Event %d\r\n",p_evt->evt_type);
	ble_nus_c_on_db_disc_evt(&m_ble_nus_c, p_evt);
//	printf("\r\nDB Discovery relayed to NUS\r\n");
}


static void uart_send_data( )
{
	uint32_t time_current;
	uint32_t time_start;
	uint8_t distance;

	uint8_t *p_data = (uint8_t *)data_array[idx_read];
	uint8_t i;
#ifdef SIMULATEINFECTION
	uint32_t time_infect;

	const char bit_rep[16][5] = {
	    "0000", "0001", "0010", "0011",
	    "0100", "0101", "0110", "0111",
	    "1000", "1001", "1010", "1011",
	    "1100", "1101", "1110", "1111",
	};
#endif

	if( p_data[0] == DSA_NUS_FLAG_TIME) //  set correct size
	{
		time_current = ((uint32_t)p_data[1])<<24;
		time_current |= ((uint32_t)p_data[2])<<16;
		time_current |= ((uint32_t)p_data[3])<<8;
		time_current |= (uint32_t)p_data[4];
		printf("General: ID: %3u, Zeittimer: %8lu \r\n", current_id, time_current);
//		printf("Status: %1u \r\n", p_data[2]);
	}
#ifdef SIMULATEINFECTION
	else if( p_data[20] == WIDTH_INFECT_ARRAY)  //  set correct size
	{
		time_infect = ((uint16_t)p_data[1])<<16;
		time_infect |= ((uint16_t)p_data[2])<<8;
		time_infect |= (uint16_t)p_data[3];
		printf("Infect: %3u, %1u, %8lu, ", current_id, p_data[0], time_infect);
		for (i=0;i<WIDTH_INFECT_ARRAY-4;i++)
		{
			printf("%s%s,", bit_rep[p_data[4+i] >> 4], bit_rep[p_data[4+i]  & 0x0F]);
		}
		printf(" \r\n");


	}
#endif
	else if( p_data[0] == DSA_NUS_FLAG_DATA ) 
	{
#define CONTACT_ENTRY_SIZE 5

		for(i=0;CONTACT_ENTRY_SIZE*i<p_data[20] ;i++)
		{
#define IDSHIFT 1


			time_start 		 = ((uint32_t)p_data[1+IDSHIFT  +i*CONTACT_ENTRY_SIZE])<<	16;
			time_start 		|= ((uint32_t)p_data[1+IDSHIFT+1+i*CONTACT_ENTRY_SIZE])<<8;
			time_start 		|=  (uint32_t)p_data[1+IDSHIFT+2+i*CONTACT_ENTRY_SIZE];
			distance     	 = ((uint8_t)p_data[1+IDSHIFT+3+i*CONTACT_ENTRY_SIZE]);
			
			printf("Netz (ID): %3u, %3u, %8lu, %3u \r\n",current_id,p_data[1+i*CONTACT_ENTRY_SIZE],time_start, distance);

		}
	}
    else if ( p_data[0] == DSA_NUS_FLAG_VOLTAGE ) //  set correct size
    {
    	printf("Power: %3u, %3u ", current_id, p_data[1]);
    	
    }
	else
	{

		for (uint32_t i = 0; i <p_data[20]; i++)
		{
			while (app_uart_put( p_data[i]) != NRF_SUCCESS);
		}
	}
	idx_read++;

}


/**@brief   Function for handling app_uart events.
 *
 * @details This function will receive a single character from the app_uart module and append it to
 *          a string. The string will be be sent over BLE when the last character received was a
 *          'new line' i.e '\r\n' (hex 0x0D) or if the string has reached a length of
 *          @ref NUS_MAX_DATA_LENGTH.
 */
void uart_event_handle(app_uart_evt_t * p_event)
{

    switch (p_event->evt_type)
    {
        /**@snippet [Handling data from UART] */
        case APP_UART_DATA_READY:

            break;
        /**@snippet [Handling data from UART] */
        case APP_UART_COMMUNICATION_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_communication);
            break;

        case APP_UART_FIFO_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_code);
            break;
        case APP_UART_TX_EMPTY:
        	if(idx_read != idx_write)
        	{
        		uart_send_data();
        	}
        	else
        	{
        		uart_active = 0;
        		idx_read = 0;
        		idx_write= 0;
        	}
        	break;
        default:
            break;
    }
}



static void uart_buffer_data( const ble_nus_c_evt_t * p_ble_nus_evt)
{
    //uint32_t err_code;
	uint8_t i;
	uint8_t *p_data = (uint8_t *)p_ble_nus_evt->p_data;
    //printf("Data received: %3u, %3u ", current_id, p_data[1]);
	/*if( p_ble_nus_evt->data_len == 8)
	{
    err_code = sd_ble_gap_disconnect(m_conn_handle,
                                      BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    APP_ERROR_CHECK(err_code);
	}*/
    printf("Data received");
	data_array[idx_write][20] = p_ble_nus_evt->data_len;
	for(i=0;i< (p_ble_nus_evt->data_len) ;i++)
	{
		data_array[idx_write][i] = p_data[i]; //ToDo rewrite using memcpy
	}
	idx_write++;
	if(!uart_active)
	{
		uart_active = 1;
		uart_send_data();
	}


}


/**@brief Callback handling NUS Client events.
 *
 * @details This function is called to notify the application of NUS client events.
 *
 * @param[in]   p_ble_nus_c   NUS Client Handle. This identifies the NUS client
 * @param[in]   p_ble_nus_evt Pointer to the NUS Client event.
 */

/**@snippet [Handling events from the ble_nus_c module] */
static void ble_nus_c_evt_handler(ble_nus_c_t * p_ble_nus_c, const ble_nus_c_evt_t * p_ble_nus_evt)
{
    uint32_t err_code;
    uint8_t init_msg[2] = {'s','t'};

    switch (p_ble_nus_evt->evt_type)
    {
        case BLE_NUS_C_EVT_DISCOVERY_COMPLETE:
//            printf("Service discovery complete.\r\n");


        	err_code = ble_nus_c_handles_assign(p_ble_nus_c, p_ble_nus_evt->conn_handle, &p_ble_nus_evt->handles);
            APP_ERROR_CHECK(err_code);
//            printf("Service handles assigned.\r\n");

            err_code = ble_nus_c_rx_notif_enable(p_ble_nus_c);
            APP_ERROR_CHECK(err_code);
//            printf("Service settings done.\r\n");
            err_code = ble_nus_c_string_send(&m_ble_nus_c, init_msg, 2);
            APP_ERROR_CHECK(err_code);
            //printf("Error code: %lu\r\n", err_code);
            printf("Init Message Sent.\r\n");
            break;

        case BLE_NUS_C_EVT_NUS_RX_EVT:
            uart_buffer_data( p_ble_nus_evt);
            break;

        case BLE_NUS_C_EVT_DISCONNECTED:
            printf("\r\nNUS Disconnected\r\n");
//            scan_start();
            break;
    }
}
/**@snippet [Handling events from the ble_nus_c module] */

/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
//static void sleep_mode_enter(void)
//{
//    uint32_t err_code = bsp_indication_set(BSP_INDICATE_IDLE);
//    APP_ERROR_CHECK(err_code);
//
//    // Prepare wakeup buttons.
//    err_code = bsp_btn_ble_sleep_mode_prepare();
//    APP_ERROR_CHECK(err_code);
//
//    // Go to system-off mode (this function will not return; wakeup will cause a reset).
//    err_code = sd_power_system_off();
//    APP_ERROR_CHECK(err_code);
//}
//


