thofbaur/network-beacon/Network_Base_nrf51422/main.c
static bool is_valid_connector(  const ble_gap_evt_adv_report_t *p_adv_report)
{
	uint8_t *p_data = (uint8_t *)p_adv_report->data;
//	uint8_t index;
   // printf("Device found with name: %.*s \r\n", 3, (char *)&p_data[POS_NAME_START]);

	if(	 ( p_data[POS_NAME_START] == identifier[0] && p_data[POS_NAME_START+1] == identifier[1] && p_data[POS_NAME_START+2] == identifier[2] ) && \
			(  p_adv_report->rssi >-100 ))
	{

//		if(p_adv_report->dlen==9)
//		{
//			index = POS_INF_STATUS;
//		}
//		else
//		{
//			index = POS_DATA;
//		}
//		if( (p_data[index] >>5)>= READOUT_LEVEL  )

		if( (p_data[7+ADV_LENGTH_ID+LENGTH_INF] >>5)>= READOUT_LEVEL  )
		{
			return true;
		}

	}
	return false;
}
/**@brief Function for handling the Application's BLE Stack events.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 */
static void on_ble_evt(ble_evt_t * p_ble_evt)
{
    uint32_t              err_code;
    const ble_gap_evt_t * p_gap_evt = &p_ble_evt->evt.gap_evt;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_ADV_REPORT:
        {
            const ble_gap_evt_adv_report_t * p_adv_report = &p_gap_evt->params.adv_report;
            if(  ((!uart_active) & central_ready))
            {
            	if (is_valid_connector( p_adv_report))
				{
					err_code = sd_ble_gap_connect(&p_adv_report->peer_addr,
												  &m_scan_params,
												  &m_connection_param);
					if (err_code == NRF_SUCCESS)
					{
						// scan is automatically stopped by the connect
						err_code = bsp_indication_set(BSP_INDICATE_IDLE);
						APP_ERROR_CHECK(err_code);
						printf("Connecting to target %02x%02x%02x%02x%02x%02x\r\n",
								 p_adv_report->peer_addr.addr[0],
								 p_adv_report->peer_addr.addr[1],
								 p_adv_report->peer_addr.addr[2],
								 p_adv_report->peer_addr.addr[3],
								 p_adv_report->peer_addr.addr[4],
								 p_adv_report->peer_addr.addr[5]
								 );
#ifdef IDLIST
						current_id =  p_adv_report->data[POS_ID];
						printf("Device ID and RSSI: %3d, %3d\r\n", current_id,p_adv_report->rssi);
#else
						memcpy(&current_mac, p_adv_report->peer_addr.addr,6);
						printf("RSSI: %3d\r\n", p_adv_report->rssi);
#endif
					}
				}
            }
        }break; // BLE_GAP_EVT_ADV_REPORT

        case BLE_GAP_EVT_CONNECTED:
            //NRF_LOG_DEBUG("Connected to target\r\n");
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            printf("Connected.\r\n");

            err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
            APP_ERROR_CHECK(err_code);
            // start discovery of services. The NUS Client waits for a discovery result
            err_code = ble_db_discovery_start(&m_ble_db_discovery, p_ble_evt->evt.gap_evt.conn_handle);
            printf("Service Discovery started with err code %4i.\r\n",(int)err_code);
            APP_ERROR_CHECK(err_code);
//            printf("Service Discovery started.\r\n");

            break; // BLE_GAP_EVT_CONNECTED

        case BLE_GAP_EVT_TIMEOUT:
            if (p_gap_evt->params.timeout.src == BLE_GAP_TIMEOUT_SRC_SCAN)
            {
                //NRF_LOG_DEBUG("Scan timed out.\r\n");
                printf("\r\nDisconnected\r\n");
				err_code = bsp_indication_set(BSP_INDICATE_IDLE);

                scan_start();
            }
            else if (p_gap_evt->params.timeout.src == BLE_GAP_TIMEOUT_SRC_CONN)
            {
                printf("Connection Request timed out.\r\n");
            }
            break; // BLE_GAP_EVT_TIMEOUT
        case BLE_GAP_EVT_DISCONNECTED:

                printf("\r\nGAP Disconnected\r\n");
				err_code = bsp_indication_set(BSP_INDICATE_IDLE);
                scan_start();

            break; // BLE_GAP_EVT_TIMEOUT
        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
            // Pairing not supported
            err_code = sd_ble_gap_sec_params_reply(p_ble_evt->evt.gap_evt.conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GAP_EVT_SEC_PARAMS_REQUEST

        case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:
            // Accepting parameters requested by peer.
            err_code = sd_ble_gap_conn_param_update(p_gap_evt->conn_handle,
                                                    &p_gap_evt->params.conn_param_update_request.conn_params);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST

        case BLE_GATTC_EVT_TIMEOUT:
            // Disconnect on GATT Client timeout event.
            //NRF_LOG_DEBUG("GATT Client Timeout.\r\n");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            err_code = bsp_indication_set(BSP_INDICATE_IDLE);
                        APP_ERROR_CHECK(err_code);
            break; // BLE_GATTC_EVT_TIMEOUT

        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server timeout event.
            //NRF_LOG_DEBUG("GATT Server Timeout.\r\n");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
			err_code = bsp_indication_set(BSP_INDICATE_IDLE);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GATTS_EVT_TIMEOUT

#if (NRF_SD_BLE_API_VERSION == 3)
        case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST:
            err_code = sd_ble_gatts_exchange_mtu_reply(p_ble_evt->evt.gatts_evt.conn_handle,
                                                       NRF_BLE_MAX_MTU_SIZE);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST
#endif

        default:
            break;
    }
}

/**@brief Function for dispatching a BLE stack event to all modules with a BLE stack event handler.
 *
 * @details This function is called from the scheduler in the main loop after a BLE stack event has
 *          been received.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 */
static void ble_evt_dispatch(ble_evt_t * p_ble_evt)
{
    on_ble_evt(p_ble_evt);
    bsp_btn_ble_on_ble_evt(p_ble_evt);
    ble_db_discovery_on_ble_evt(&m_ble_db_discovery, p_ble_evt);
    ble_nus_c_on_ble_evt(&m_ble_nus_c,p_ble_evt);
}

/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    uint32_t err_code;

